Revit 2024 API
IPipePlumbingFixtureFlowServer Interface
 Interface class for external servers implementing Pipe plumbing fixture flow calculation.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public interface IPipePlumbingFixtureFlowServer : IExternalServer
Visual Basic
Public Interface IPipePlumbingFixtureFlowServer _
	Inherits IExternalServer
Visual C++
public interface class IPipePlumbingFixtureFlowServer : IExternalServer
Remarks
 A typical way to use the external server can be:
Implement a server class that derives from this interface
Create a new server object and register it with the service, see ExternalServiceRegistry.
Assign server for the plumbing flow conversion in PipeSettings.
See Also
IPipePlumbingFixtureFlowServer Members
Autodesk.Revit.DB.Plumbing Namespace